#Series
Es un objeto similar a una matriz unidimensional que contiene una secuencia de valores y una matriz asociada de etiquetas de datos, denominada índice.

Para utilizar esta estructura, se debe de importar de la librería de pandas

In [ ]:
import pandas as pd  #Generar un alias para la librería
from pandas import Series

##Inicialización

`Series(data=lista, index=indices, dtype=tipo)`

In [ ]:
ej=pd.Series(data=[1,2,3,4],index=['uno','dos','tres','cuatro'],dtype='int64')

In [ ]:
ej

uno       1
dos       2
tres      3
cuatro    4
dtype: int64

In [ ]:
ej2=pd.Series([1,2,3,4])

-- Con listas ya establecidas

In [ ]:
ej2

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
#Generar listas
nombre=['Pikachu','Charmander','Chikorita','Muk','Artikuno']
tipo=['Electrico','Fuego','Hierba','Veneno','Volador']

-- Con tuplas de datos

In [ ]:
Ej4=pd.Series({'Matematicas':7.8,'Ciencias':8.0})
Ej4

Matematicas    7.8
Ciencias       8.0
dtype: float64

##Atributos

In [ ]:
Ej3=pd.Series([43,56,25,78,96],['aa','bb','cc','dd','ee'])
print(Ej3)
print("\n",Ej3.size)
print("\n",Ej3.index)
print("\n",Ej3.dtype)
print("\n",Ej3.values)

aa    43
bb    56
cc    25
dd    78
ee    96
dtype: int64

 5

 Index(['aa', 'bb', 'cc', 'dd', 'ee'], dtype='object')

 int64

 [43 56 25 78 96]

##Funciones aplicables

In [ ]:
#Ejemplos con serie numérica
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
print("\n",Ej1.count())
print("\n",Ej1.sum())
print("\n",Ej1.cumsum())
print("\n",Ej1.min())
print("\n",Ej1.max())
print("\n ",Ej1.mean())
print("\n",Ej1.std())
print("\n",Ej1.describe())

 6

 38

 a     3
b     9
c    17
d    19
e    24
f    38
dtype: int64

 2

 14

  6.333333333333333

 4.320493798938574

 count     6.000000
mean      6.333333
std       4.320494
min       2.000000
25%       3.500000
50%       5.500000
75%       7.500000
max      14.000000
dtype: float64

In [ ]:
Ej1.describe()

count     6.000000
mean      6.333333
std       4.320494
min       2.000000
25%       3.500000
50%       5.500000
75%       7.500000
max      14.000000
dtype: float64

Con valores de tipo cadena

In [ ]:
#Ejemplos con serie tipo cadena
Ej1=pd.Series(['ab','bc','cd','bc','cd','bc'],[3,6,8,2,7,14])
print("\n",Ej1.count())
print("\n",Ej1.sum())
print("\n",Ej1.cumsum())
print("\n",Ej1.min())
print("\n",Ej1.max())
#print("\n",Ej1.mean())
#print("\n",Ej1.std())
print("\n ",Ej1.describe())

 6

 abbccdbccdbc

 3               ab
6             abbc
8           abbccd
2         abbccdbc
7       abbccdbccd
14    abbccdbccdbc
dtype: object

 ab

 cd

  count      6
unique     3
top       bc
freq       3
dtype: object

##Seleccionar/modificar de datos
De pueden seleccionar elementos específicos de una serie, ya sea por índice  o por clave

In [ ]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
Ej1

a     3
b     6
c     8
d     2
e     5
f    14
dtype: int64

###iloc/loc
Se uilizan para modificar o seleccionar elementos específicos de una serie, ya sea por índice (iloc) o por clave (loc)
Iloc se utiliza para modificar

In [ ]:
## Serie con claves
Sc=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])

print(Sc[4])
print(Sc.iloc[4])

5
5

<ipython-input-74-4624fbaf7f98>:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(Sc[4])

##Agregar
Para agregar datos en una serie que ya tiene claves,solo se agrega la nueva clave con una asignación

In [ ]:
Ejemplo=pd.Series(['Gokú','Vegeta','Trunks','Gohan'],['a','b','c','d'])
Ejemplo

a      Gokú
b    Vegeta
c    Trunks
d     Gohan
dtype: object

In [ ]:
Ejemplo['f']='Goten'
Ejemplo

a      Gokú
b    Vegeta
c    Trunks
d     Gohan
f     Goten
dtype: object

In [ ]:
Ejemplo=pd.Series(['Gokú','Vegeta','Trunks','Gohan'])
Ejemplo[7]='Goten'
Ejemplo.index

Index([0, 1, 2, 3, 7], dtype='int64')

In [ ]:
#¿Como agregrar el indice que sigue?

## Eliminar (drop-pop)
-- Drop: Devuelve una copia de la serie tras eliminar el elemento cuya etiqueta se especifica como argumento

-- Pop: Acepta una etiqueta y devuelve el valor correspondiente a dicha etiqueta, eliminándolo de la serie

In [ ]:
import pandas as pd

In [ ]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
Ej1

a     3
b     6
c     8
d     2
e     5
f    14
dtype: int64

In [ ]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
##### DROP  ####### Devuelve una copia
Ej1.drop(['d','e'])
Ej1

a     3
b     6
c     8
d     2
e     5
f    14
dtype: int64

In [ ]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
##### VAROIANTE DE DROP  ####### Devuelve una copia
Ej1.drop(['d','e'],inplace=True) #Atributo de sobreescritura
Ej1

a     3
b     6
c     8
f    14
dtype: int64

In [ ]:
######## POP ##### Borra y retorna el valor
Ej2=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
print('POP')
DatoEliminar=Ej2.pop('c')
type(DatoEliminar)

POP

numpy.int64

In [ ]:
Ej2

a     3
b     6
d     2
e     5
f    14
dtype: int64

In [ ]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
##Programa que pida una clave, la borre de la serie e imprima el mensale
##"El valor eliminado es.."
clave=input('Inserte una clave')
eliminado=Ej1.pop(clave)
print('El valor eliminado es:',eliminado)

Inserte una clavea
El valor eliminado es: 3

In [ ]:
Ej1.index

Index(['juan', 'toño', 'mario'], dtype='object')

In [ ]:
import pandas as pd
Ej1=pd.Series([1,2,3,4,5],['pepe','juan','toño','maria','mario'])
#1
print('1.')
print(Ej1)
print('\n')
#2
print('2.')
print('Nombre 1:',Ej1.index[0])
print('Edad 1:',Ej1['pepe'])
print('Nombre 3:',Ej1.index[2])
print('Edad 3:',Ej1['toño'])
print('\n')
#3
print('3.')
print(Ej1.index[2])
print('\n')
Ej2=Ej1.copy()
prov1=Ej2.pop('pepe')
print('\n')
#4
print('4.')
print(prov1)
prov2=Ej1.drop('maria')
print('\n')
#5
print('5.')
print(prov2)
Ej1.pop('mario')
print('\n')
#6
print('6.')
print(Ej1)

1.
pepe     1
juan     2
toño     3
maria    4
mario    5
dtype: int64


2.
Nombre 1: pepe
Edad 1: 1
Nombre 3: toño
Edad 3: 3


3.
toño




4.
1


5.
pepe     1
juan     2
toño     3
mario    5
dtype: int64


6.
pepe     1
juan     2
toño     3
maria    4
dtype: int64

In [ ]:
#Generar una serie con los nombres de 5 personas como indice y la edad como valor
serie=pd.Series([1,2,3,4,5],['pepe','juan','toño','maria','mario'])
print('1.')
serie

1.

pepe     1
juan     2
toño     3
maria    4
mario    5
dtype: int64

In [ ]:
serie.iloc[[0,1]]

pepe    1
juan    2
dtype: int64

In [ ]:
#Imprimir el nombre de la persona en el lugar 3
serie.index[3]

'maria'

In [ ]:
#Imprimir la edad de la persona en el lugar 1
serie.iloc[0]

1

In [ ]:
#Eliminar a la persona del lugar 4
serie.drop(serie.index[3],inplace=True)
serie

pepe     1
juan     2
toño     3
mario    5
dtype: int64

In [ ]:
serie=pd.Series([43,23,70,12],['Juan','Maria','Pedro','Bonifacio'])
serie.pop(serie.index[serie.size-1])
serie

Juan     43
Maria    23
Pedro    70
dtype: int64

In [ ]:
%%shell
jupyter nbconvert --to html 2_1_1_Series.ipynb

[NbConvertApp] Converting notebook 2_1_1_Series.ipynb to html
[NbConvertApp] Writing 660840 bytes to 2_1_1_Series.html